Revit 2015 API
BeamSystemTypeSet.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual int Erase(
	BeamSystemType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As BeamSystemType _
) As Integer
Visual C++
public:
virtual int Erase(
	BeamSystemType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.BeamSystemType
See Also
BeamSystemTypeSet Class
Autodesk.Revit.DB Namespace